package KoreanWave;
import java.util.*;
import java.util.ArrayList;

public class y_1990 implements His_per_year {



    @Override
    public void GetYear() {
        System.out.println("1990년대의 kpop\n");
        
    }

    @Override
    public void GetContent() {
        System.out.println("1990년대 초중반의 대중음악을 이야기를 할 때는 서태지와 아이들을 빼놓을 수가 없었다. \n이들이 데뷔한 1992년을 기점으로 대한민국 아이돌들과 아이돌 문화가 생성되기 \n시작했다. 서태지와 아이들은 남성 아이돌 그룹의 시초라고 볼 수 있다. 그 이전에는 현재 \n통용되는 아이돌이라는 개념이 아직 성립이 되지 않았던 시절이다. 또한 당대에 그들이 처음 \n선보인 고유한 특징들(음악의형태 활동방식 팬덤문화 등)과 더불어 후대에 끼친 광범위한 \n영향력탓에, 해외언론에선 현대적인 케이팝(Modern K-pop)의 시작점을 서태지와 \n아이들로 기정사실화 하고있다. 국내의 문화비평계에서도 함께 인정하는 부분. 록 \n분야에선 시나위 출신 보컬로 솔로로 데뷔한 김종서와 '마왕' 신해철과 그가 이끌던 \n록밴드 N.EX.T가 90년대 초중반(1992 ~ 1997)에 히트했으며 90년대 후반에는 김경호가\n 큰 인기를 끌며 한국에서 락 발라드라고 불리우는 장르의 인기를 촉발했다. 나이트클럽 DJ\n나 이태원 문나이트에서 댄스를 추던 많은 사람들이 제작자 및 작곡가 그리고 가수 \n등으로 뛰쳐나온 시기가 되었다. 당시 이른바 5대 작곡가로 \n불리던 김창환, 최준영, 영훈, 윤일상, 김형석 중 김창환과 최준영이 대표적인 DJ 출신 \n작곡가였고, 서태지와 아이들을 제작한 유대영 역시 유명한 DJ였다. 서태지와 아이들의 \n아이들을 이루던 양현석과 이주노는 유명한 댄서였고, 현진영과 와와도 유명한 댄서 출신 \n가수였다. 무엇보다도 현진영의 경우 현재 K-POP의 한축을 이루고 있는 이수만이 이끄는 \nSM의 1호 가수였다는 점에서 서서히 현재 K-POP의 원형들이 나타나기 시작했다고 볼 수 \n있겠다. 와와의 경우도 1~2기 모두 유명한 댄스가수인 클론과 듀스로 성장하였다. 한편 \n걸그룹의 시초는 1993년 언론에 처음으로 소개된다. 바로 중앙대학교 연극영화학과 4\n학년생들이 최초로 칼라라는 걸그룹을 만들어 1993년 강변가요제에서 '후회하고 \n있는거야'라는 데뷔곡으로 대상을 받았는데, 이들이 걸그룹의 시초라고 볼 수 있다. 이렇듯 \n댄스가요는 1990년대 초중반을 그야말로 강타하는 상황이었다. 그러다 서태지와 아이들이 \n1996년 은퇴를 선언하게 되면서 그야말로 대중 가요계에 기점이 생기기 시작했다. \n바로 서태지와 아이들 은퇴 직후 등장한 H.O.T.를 시작으로 전문적인 아이돌 그룹이 등장하기\n 시작한 것이다. 이들은 이전의 가수들과는 차원이 달랐다. 이전 데뷔했던 가수들은 대부분 \n이미 다른 분야에서 활동을 하거나 혹은 즉석으로 캐스팅 되어서 가수로 데뷔하는 경우가 \n많았다. 그로 인해 전문적인 가수라는 느낌보다는 본인들의 일을 가요식으로 전환해서 한다는\n 느낌이 강했다. 하지만 아이돌 그룹들은 달랐다. 기본적으로 연습생 시기를 거쳐서 \n소속사의 혹독한 트레이닝을 거쳐서 데뷔한다. 즉, 준비된 사람들만이 데뷔를 한다는 점이다.\n 또한 활동 역시 회사의 전문적인 계획 아래 운영이 된다는 점이다. 그래서 이들은 앨범이 \n나오는 시기의 텀도 이전 가수들에 비해서는 굉장히 긴 편에 속했다. 그리고 팬클럽이라는 \n구조도 본격적으로 회사에서 관리하는 체제로 들어갔다. 즉 팬덤을 중심으로 하는 새로운 \n체제가 등장했고 이 체제는 2020년대를 지나는 현재도 꾸준히 진행되고 있는 K-POP의 가수\n 생산 체제이기도 하다. 또한 소속사 내에서 주요 작곡가가 있어서 이른바 소속사 \n스타일이라는게 처음으로 정립되기 시작한 시기이기도 했다.\n");
    }

    @Override
    public void GetMem() {
        List<String> list = new ArrayList<String>();
        list.add("서태지와 아이들");
        list.add("김종서");
        list.add("N.EX.T");
        list.add("김경호");
        list.add("젝스키스");
        list.add("신화");
        list.add("god");
        list.add("베이비복스");
        list.add("S.E.S");
        list.add("핑클");
        list.add("룰라");
        list.add("쿨");
        list.add("자우림");
        list.add("코요태");
        list.add("신승훈");
        list.add("조성모");
        System.out.println(list);




    }
    
}
