package KoreanWave;
import java.util.*;
import java.util.ArrayList;

public class y_2000 implements His_per_year {



    @Override
    public void GetYear() {
        System.out.println("2000년대의 kpop");
        
    }

    @Override
    public void GetContent() {
        System.out.println("2000년대 초반부터 1세대 아이돌 그룹이 퇴장하고부터는 다른 식의 가수들이 많이 등장하기 시작했다. 우선 여성 가수 쪽에서는 핑클, S.E.S., 베이비복스가 퇴장하고 난 뒤엔 어린 여성 솔로 가수들이 활발한 활동으로 인기를 얻었다. 특히 BoA의 경우 일본에서도 상당한 인기를 모으고 그 인기를 바탕으로 국내에서도 인기를 끌었던 가수였다. 또한 1990년대 후반부터 살아 남았던 혼성그룹인 쿨과 코요태도 2000년대 초반까지 전성기를 보냈다. 남성 아이돌 그룹에서도 H.O.T.와 젝스키스의 퇴장 이후 god가 전국민적인 인기를 끌었다. 장르 면에서는 대중들이 이른바 발라드에 조금 더 관심을 지니기 시작했던 시기였다. 그나마 댄스 분야에서는 여성 솔로로 이효리, 남성 솔로로 비가 전 국민적인 인기를 끌면서 대상을 차지하는 등 명맥을 유지해나가던 시절이었다. 상대적으로 덜 부각되긴 했지만 2000년대에 들어서는 J.ae '어제처럼'의 흥행으로 인해 한국 대중가요계에서는 R&B 장르의 서막을 알리기 시작했다. 2001년 브라운 아이즈의 데뷔 이후 본격적인 R&B 열풍이 불기 시작했다. 2004년 미디엄 템포 발라드를 주력으로 하는 SG워너비의 등장과 대히트 이후 수많은 가수들이 천편일률적으로 소몰이창법만 써서 비슷한 분위기의 노래를 부르기 시작했고 대중들이 지칠 무렵, 2000년대 중후반부터 아이돌 그룹이 유행을 타기 시작했다.  참고로 이는 발성, 창법이 성대에 매우 좋지 않기 때문에 이 시절에 소몰이창법을 사용했었던 플라이 투 더 스카이, 박효신도 창법을 바꿨고, 심지어 대표주자였던 SG워너비조차 성대결절로 창법을 바꾸었다. 2000년대 초반에 1세대 아이돌들이 퇴장하고 중반에는 소몰이창법이 크게 유행을 탄 것은 사실이지만, 아이돌 그룹의 명맥이 완전히 끊기지는 않았다. 1990년대에 결성된 혼성그룹들은 2000년대에 와서도 어느 정도 인기를 유지했으나, 신규 결성 그룹은 확연히 줄어들었다. 2000년대에 결성된 혼성그룹은 2001년 거북이, 2006년 타이푼, 2007년 써니힐,  2009년 어반자카파 등이 전부였었고 이들은 나름대로의 색깔로 인기를 끌었으나 높은 인기를 오랫동안 지속하지는 못했었고 1990년대 후반~2000년닥 이후 1세대 아이돌의 맥이 거의 끊긴 뒤 2000년대 초반은 댄스를 추는 아이돌, 특히 걸그룹은 이렇다 할 주목을 받지 못하던 시절이었다. 2세대아이돌의 원형이 되는 동방신기가 큰 팬덤을 형성하며 인기를 끌었던 거 외에 이후 SS501, 슈퍼주니어 등이 활동하긴 했으나 대중들에게 크게 인정받는 상황은 아니었고, 걸그룹의 경우에는 쥬얼리 정도만이 명맥을 유지할 수 있었다. 그나마 인기 있던 걸그룹이었던 씨야는 정통적인 아이돌 그룹은 아니었으니 애초에 논외였던 상황이었다. 그러다 2007년  YG와 JYP에서 야심차게 준비한 남녀 아이돌 빅뱅과 원더걸스가 각각 거짓말, Tell Me라는 곡으로 대중들에게서 선풍적인 인기를 끌기 시작하면서 2000년대 초중반을 감싸고 있던 R&B와 발라드 열풍을 끝내고, 다시금 가요계에 댄스 음악들을 불러 들어오기 시작했다. 2008년 역시 히트곡들을 내며 최고의 인기를 이어갔고, 2009년에는 소녀시대가 Gee와 소원을 말해봐로 뮤직뱅크와 각종 차트에서 1위를 했으며, 슈퍼주니어 Sorry, Sorry, 2NE1의 I DON'T CARE, 카라의 미스터 등을 시작으로 하는 걸그룹 열풍과 아이돌 그룹들이 대규모로 등장하여 K-POP의 현재를 이루어 나가는 시기로 돌입하기 시작하였다.\n");
    }

    @Override
    public void GetMem() {
        List<String> list = new ArrayList<String>();
        list.add("핑클");
        list.add("S.E.S.");
        list.add("BoA");
        list.add("쿨");
        list.add("코요태");
        list.add("이효리");
        list.add("비");
        list.add("베이비복스");
        list.add("J.ae");
        list.add("브라운 아이즈");
        list.add("SG워너비");
        list.add("플라이 투 더 스카이");
        list.add("빅뱅");
        list.add("거북이");
        list.add("타이푼");
        list.add("써니힐");
        list.add("어반자카파");
        list.add("동방신기");
        list.add("SS501");
        list.add("슈퍼주니어");
        list.add("씨야");
        list.add("원더걸스");
        list.add("소녀시대");
        list.add("2NE1");
        list.add("카라");
        System.out.println(list);




    }
    
}
